# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# CLI Tools
brew "bash"              # Latest version of Bash
brew "git"               # Latest version of Git
brew "starship"          # Cross-shell prompt
brew "bat"               # Cat clone with syntax highlighting
brew "exa"               # Modern replacement for ls
brew "fd"                # Simple, fast alternative to find
brew "fzf"               # Fuzzy finder
brew "jq"                # Command-line JSON processor
brew "ripgrep"           # Fast grep alternative
brew "tmux"              # Terminal multiplexer
brew "htop"              # Interactive process viewer
brew "vim"               # Improved vi editor
brew "tree"              # Display directories as trees
brew "wget"              # Internet file retriever

# Development Tools
brew "docker"            # Containerization platform

# GUI Applications
cask "visual-studio-code"    # Code editor
cask "iterm2"                # Better terminal
cask "google-chrome"         # Web browser
cask "firefox"               # Web browser
cask "slack"                 # Messaging app
cask "zoom"                  # Video conferencing
cask "rectangle"             # Window manager

# Fonts
cask "font-fira-code"        # Monospaced font with programming ligatures
cask "font-jetbrains-mono"   # Monospaced font for coding
