# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Baseline System Packages
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "curl"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "nmap"
brew "pstree"
brew "starship"
brew "tree"
brew "vim"
brew "wget"

# Virtualization / Containerization tools
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"

# GUI Applications
cask "visual-studio-code"
cask "iterm2"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "zoom"
cask "rectangle"

# Fonts
cask "font-fira-code"        # Monospaced font with programming ligatures
cask "font-jetbrains-mono"   # Monospaced font for coding
